# EnergyAnalysisOutdoorAirInformationParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisOutdoorAirInformationParam Property
ParameterTypeId Class See Also
---
"Outdoor Air Information"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisOutdoorAirInformationParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisOutdoorAirInformationParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisOutdoorAirInformationParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace